import 'hadith_model.dart';

List<HadithModel> allHadiths = [
  HadithModel(
    title: "الحديث الأول",
    content: "عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه ، قال : سمعت رسول الله صلى الله عليه وسلم يقول : ( إنما الأعمال بالنيات وإنما لكل امرئ ما نوى . فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ).\n\nرواه إمام المحدثين أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بردزبه البخاري الجعفي،[رقم:1] وابو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري [رقم : 1907] رضي الله عنهما في صحيحيهما اللذين هما أصح الكتب المصنفة.",
  ),
  HadithModel(
    title: "الحديث الثاني",
    content: "عن عمر رضي الله عنه أيضا ، قال : بينما نحن جلوس عند رسول الله صلى الله عليه وسلم ذات يوم اذ طلع علينا رجل شديد بياض الثياب ، شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا احد. حتى جلس إلى النبي صلي الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه، وقال: \" يا محمد أخبرني عن الإسلام \".\nفقال رسول الله صلى الله عليه وسلم :(الإسلام أن تشهد أن لا إله إلا الله وأن محمد رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت اليه سبيلا).\nقال : صدقت.\nفعجبنا له ، يسأله ويصدقه ؟\nقال : فأخبرني عن الإيمان .\nقال : أن تؤمن بالله وملائكته وكتبه ورسله واليوم الاخر وتؤمن بالقدر خيره وشره .\nقال : صدقت .\nقال : فأخبرني عن الإحسان .\nقال : ان تعبد الله كأنك تراه ، فإن لم تكن تراه فإنه يراك .\nقال : فأخبرني عن الساعة .\nقال : \"ما المسؤول عنها بأعلم من السائل \"\nقال : فأخبرني عن أماراتها .\nقال : \" أن تلد الأم ربتها ، وان ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان\"\nثم انطلق ، فلبثت مليا ،ثم قال :\" يا عمر أتدري من السائل ؟\"\nقلت : \"الله ورسوله أعلم \".\nقال : فإنه جبريل ، اتاكم يعلمكم دينكم \"رواه مسلم [ رقم : 8 ].",
  ),
  HadithModel(
    title: "الحديث الثالث",
    content: "عن أبي عبد الرحمن عبد الله بن عمر بن الخطاب رضي الله عنهما ، قال : سمعت رسول الله صلى الله عليه وسلم يقول :( بني الإسلام على خمس : شهادة أن لا إله إلا الله وأن محمد رسول الله ، وإقامة الصلاة ، وإيتاء الزكاة ، وحج البيت ، وصوم رمضان ) رواه البخاري [ رقم : 8 ] ومسلم [ رقم : 16 ].",
  ),
  HadithModel(
    title: "الحديث الرابع",
    content: "عن أبي عبد الرحمن عبد الله بن مسعود رضي الله عنه ، قال : حدثنا رسول الله صلي الله عليه وسلم – وهو الصادق المصدوق - :( إن أحدكم يجمع خلقه في بطن أمه أربعين يوما نطفه ، ثم يكون علقة مثل ذلك ، ثم يكون مضغة مثل ذلك ، ثم يرسل إليه الملك ، فينفخ فيه الروح ، ويؤمر بأربع كلمات : بكتب رزقه ، واجله ، وعمله ، وشقي أم سعيد ؛ فوالله الذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنه حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها . وإن أحدكم ليعمل بعمل أهل النار حتي ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها ) رواه البخاري [ رقم : 3208 ] ومسلم [ رقم : 2643 ].",
  ),
  HadithModel(
    title: "الحديث الخامس",
    content: "عن ام المؤمنين أم عبد الله عائشة رضي الله عنها ، قالت : قال رسول الله صلي الله صلى الله عليه وسلم (من أحدث في أمرنا هذا ما ليس منه فهو رد ). رواه البخاري [ رقم : 2697 ] ، ومسلم [ رقم :1718 ].\nوفي رواية لمسلم : ( من عمل عملا ليس عليه أمرنا فهو رد ).",
  ),
  HadithModel(
    title: "الحديث السادس",
    content: "عن أبي عبد الله النعمان بن بشير رضي الله عنهما ، قال : سمعت رسول الله صلي الله عليه وسلم يقول: ( إن الحلال بين ، وإن الحرام بين ، وبينهما أمور مشتبهات لا يعلمهن كثير من الناس ، فمن اتقى الشبهات فقد استبرأ لدينه وعرضه ، ومن وقع في الشبهات وقع في الحرام ، كالراعي يرعى حول الحمى يوشك أن يرتع فيه،ألا وإن لكل ملك حمى ، ألا وإن حمى الله محارمه ، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله ، وإذا فسدت فسد الجسد كله ، ألا وهي القلب) رواه البخاري [ رقم : 52 ] ومسلم [ رقم : 1599 ] .",
  ),
  HadithModel(
    title: "الحديث السابع",
    content: "عن أبي رقية تميم بن أوس الداري رضي الله عنه ، أن النبي صلى الله عليه وسلم قال :( الدين النصيحة ).\nقلنا : لمن ؟؟\nقال : ( لله ، ولكتابه ، ولرسوله ، ولأئمة المسلمين وعامتهم ) رواه مسلم [ رقم : 55 ].",
  ),
  HadithModel(
    title: "الحديث الثامن",
    content: "عن ابن عمر رضي الله عنهما ، ان رسول الله صلى الله عليه وسلم قال :( أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمد رسول الله ، ويقيموا الصلاة ، ويؤتوا الزكاة ؛ فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام ، وحسابهم على الله تعالى ) رواه البخاري [ رقم:25] ومسلم [ رقم : 22].",
  ),
  HadithModel(
    title: "الحديث التاسع",
    content: "عن أبي هريرة عبد الرحمن بن صخر رضي الله عنه ، قال : سمعت رسول الله صلى الله عليه وسلم يقول : ( ما نهيتكم عنه فاجتنبوه ، وما أمرتكم به فأتوا منه ما استطعتم ، فإنما أهلك الذين من قبلكم كثرة مسائلهم واختلافهم على انبيائهم ). رواه البخاري [ رقم : 7288 ] ، ومسلم [ رقم : 1337]",
  ),
  HadithModel(
    title: "الحديث العاشر",
    content: "عن أبي هريرة رضي الله عنه ، قال : قال رسول الله صلي الله عليه وسلم :( إن الله تعالى طيب لا يقبل إلا طيبا ، وإن الله أمر المؤمنين بما أمر به المرسلين فقال تعالى :{ يا أيها الرسل كلوا من الطيبات واعملوا صالحا } ، وقال تعالى :{ يا أيها الذين امنوا كلوا من طيبات ما رزقناكم } ، ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يده إلى السماء : يا رب ! يا رب ! ومطعمه حرام ومشربه حرام وملبسه حرام وغذي بالحرام فأنى يستجاب له ؟. رواه مسلم [ رقم : 1015 ] .",
  ),
  HadithModel(
    title: "الحديث الحادي عشر",
    content: "عن أبي محمد الحسن بن على بن ابي طالب سبط رسول الله صلى الله عليه وسلم وريحانته رضي الله عنهما ، قال : حفظت من رسول الله صلى الله عليه وسلم : ( دع ما يريبك إلى ما لا يريبك ).\nرواه الترمذي [ رقم : 2520 ] ، والنسائي [ رقم : 5711 ] ، وقال الترمذي : حديث حسن صحيح.",
  ),
  HadithModel(
    title: "الحديث الثاني عشر",
    content: "عن أبي هريرة رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : ( من حسن إسلام المرء تركه ما لا يعنيه ).\nحديث حسن ، رواه الترمذي [ رقم : 2318 ] ابن ماجه [ رقم : 3976 ].",
  ),
  HadithModel(
    title: "الحديث الثالث عشر",
    content: "عن أبي حمزة أنس بن مالك رضي الله عنه ، خادم رسول الله صلى الله عليه وسلم،عن النبي صلي الله عليه وسلم قال : ( لا يؤمن احدكم حتي يحب لأخيه ما يححب لنفسه ).\nرواه البخاري [ رقم : 13 ] ، ومسلم [ رقم : 45 ].",
  ),
  HadithModel(
    title: "الحديث الرابع عشر",
    content: "عن ابن مسعود رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : ( لا يحل دم امرىء مسلم [ يشهد أن لا إله إلا الله ، وأني رسول الله ] إلا بإحدي ثلاث : الثيب الزاني ، والنفس بالنفس ، والتارك لدينه المفارق للجماعة ).\nرواه البخاري [ رقم : 6878 ] ، ومسلم [ رقم : 1676 ].",
  ),
  HadithModel(
    title: "الحديث الخامس عشر",
    content: "عن أبي هريرة رضي الله عنه ، ان رسول الله صلي الله عليه وسلم قال : ( من كان يؤمن بالله واليوم الأخر فليقل خيرًا أو ليصمت ، ومن كان يؤمن بالله واليوم الأخر فليكرم جاره ، ومن كان يؤمن بالله واليوم الأخر فليكرم ضيفه ).\nرواه البخاري [ رقم : 6018 ] ، ومسلم [ رقم : 47 ].",
  ),
  HadithModel(
    title: "الحديث السادس عشر",
    content: "عن أبي هريرة رضي الله عنه ، ان رجلا قال للـنبي صلي الله عليه وسلم : أوصني .\nقال :( لا تغضب ) فردد مرارًا ، قال : ( لا تغضب ).\nرواه البخاري [ رقم : 6116 ].",
  ),
  HadithModel(
    title: "الحديث السابع عشر",
    content: "عن أبي يعلى شداد بن اوس رضي الله عنه ، عن الرسول صلى الله عليه وسلم قال : ( إن الله كتب الإحسان على كل شيء ، فإذا قتلتم فأحسنوا القتلة ، واذا ذبحتم فأحسنوا الذبحة ، وليحد أحدكم شفرته ، وليرح ذبيحته ).\nرواه مسلم [ رقم : 1955 ].",
  ),
  HadithModel(
    title: "الحديث الثامن عشر",
    content: "عن أبي ذر جندب بن جنادة ، وأبي عبد الرحمن معاذ بن جبل رضي الله عنهما ، عن الرسول صلي الله عليه وسلم ، قال : ( اتق الله حيثما كنت ، وأتبع السيئة الحسنة تمحها ، وخالق الناس بخلق حسن ).\nرواه الترمذي [ رقم : 1987 ] وقال : حديث حسن ، وفي بعض النسخ : حسن صحيح .",
  ),
  HadithModel(
    title: "الحديث التاسع عشر",
    content: "عن أبي العباس عبد الله بن عباس رضي الله عنهما ، قال : كنت خلف النبي صلي الله عليه وسلم يوما ، فقال : ( يا غلام ! إني اعلمك كلمات : احفظ الله يحفظك ، احفظ الله تجده تجاهك ، إذا سألت فاسأل الله ، وإذا استعنت فاستعن بالله ، واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك ، وإن اجتمعوا على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك ؛ رفعت الأقلام وجفت الصحف ).\nرواه الترمذي [ رقم : 2516 ] وقال : حديث حسن صحيح .",
  ),
  HadithModel(
    title: "الحديث العشرون",
    content: "عن أبي مسعود عقبة بن عمرو الأنصاري البدري رضى الله عنه قال : قال رسول الله صلي الله علية وسلم : ( إن مما أدرك الناس من كلام النبوة الأولى : إذا لم تستح فاصنع ما شئت ).\nرواه البخاري [ رقم : 3483 ].",
  ),
  HadithModel(
    title: "الحديث الحادي والعشرون",
    content: "عن أبي عمرو ، وقيل أبي عمرة ؛ سفيان بن عبد الله الثقفي رضي الله عنه ، قال : قلت : يا رسول الله ! قل لي في الإسلام قولا لا أسأل عنه أحدًا غيرك ؛ قال : ( قل : آمنت بالله ، ثم استقم ).\nرواه مسلم [ رقم : 38 ].",
  ),
  HadithModel(
    title: "الحديث الثاني والعشرون",
    content: "عن أبي عبد الله جابر بن عبد الله الأنصاري رضي الله عنهما : أن رجلا سأل رسول الله صلي الله عليه وسلم ، فقال : أرأيت إذا صليت المكتوبات ، وصمت رمضان ، وأحللت الحلال ، وحرمت الحرام ، ولم أزد علي ذلك شيئًا ؛ أأدخل الجنة ؟ قال : ( نعم ).\nرواه مسلم [ رقم : 15 ].",
  ),
  HadithModel(
    title: "الحديث الثالث والعشرون",
    content: "عن أبي مالك الحارث بن عاصم الأشعري رضي الله عنه ، قال : قال رسول الله صلي الله عليه وسلم : ( الطهور شطر الإيمان ، والحمد لله تملأ الميزان ، وسبحان الله والحمد لله تملأن – أو : تملأ – ما بين السماء والأرض ، والصلاة نور ، والصدقة برهان ، والصبر ضياء ، والقرآن حجة لك أو عليك ؛ كل الناس يغدو ، فبائع نفسه فمعتقها ، أو موبقها ).\nرواه مسلم [ رقم : 223 ].",
  ),
  HadithModel(
    title: "الحديث الرابع والعشرون",
    content: "عن أبي ذر الغفاري رضي الله عنه ، عن النبي صلي الله علية وسلم ، فيما يرويه عن ربه تبارك وتعالى ، أنه قال : ( يا عبادي : إني حرمت الظلم على نفسي ، وجعلته بينكم محرما ؛ فلا تظالموا.\nيا عبادي ! كلكم ضال إلا من هديته ، فاستهدوني أهدكم .\nيا عبادي ! كلكم جائع إلا من أطعمته ، فاستطعموني أطعمكم.\nيا عبادي ! كلكم عار إلا من كسوته ، فاستكسوني أكسكم .\nيا عبادي ! إنكم تخطئون بالليل والنهار ، وأنا أغفر الذنوب جميعا فأستغفروني أغفر لكم .\nيا عبادي ! إنكم لن تبلغوا ضري فتضروني ، ولن تبلغوا نفعي فتنفعوني .\nيا عبادي ! لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقي قلب رجل واحد منكم ، ما زاد ذلك في ملكي شيئًا .\nيا عبادي ! لو أن أولكم وأخركم وإنسكم وجنكم كانوا علي أفجر قلب رجل واحد منكم ، ما نقص ذلك من ملكي شيئًا .\nيا عبادي ! لو أن أولكم وأخركم وإنسكم وجنكم قاموا في صعيد واحد ، فسألوني ، فأعطيت كل واحد مسألته ، ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر .\nيا عبادي ! إنما هي أعمالكم أحصيها لكم ، ثم أوفيكم إياها ؛ فمن وجد خيرًا فليحمد الله ، ومن وجد غير ذلك فلا يلومن إلا نفسه ).\nرواه مسلم [ رقم : 2577 ].",
  ),
  HadithModel(
    title: "الحديث الخامس والعشرون",
    content: "عن أبي ذر رضي الله عنه أيضا ، أن ناسًا من أصحاب رسول الله صلي الله عليه وسلم قالوا للنبي صلي الله عليه وسلم : يا رسول الله ذهب أهل الدثور بالاجور ؛ يصلون كما نصلي ، ويصومون كما نصوم ، ويتصدقون بفضور أموالهم . قال : ( أوليس قد جعل الله لكم ما تصدقون ؟ إن لكم بكل تسبيحة صدقة ، وكل تكبيرة صدقة ، وكل تحميدة صدقة ، وكل تهليلة صدقة ، وأمر بالمعروف صدقة ، ونهي عن المنكر صدقة ، وفي بضع أحدكم صدقة ).\nقالوا : يا رسول الله ، أيأتي أحدنا شهوته ويكون له فيها أجر؟\nقال : ( أرأيتم لو وضعها في حرام ، أكان عليه وزر ؟ فكذلك إذا وضعها في الحلال ، كان له أجر ).\nرواه مسلم [ رقم : 1006 ].",
  ),
  HadithModel(
    title: "الحديث السادس والعشرون",
    content: "عن أبي هريرة رضي الله عنه ، قال : قال رسول الله صلي الله عليه وسلم : ( كل سلامى من الناس عليه صدقة كل يوم تطلع فيه الشمس تعدل بين اثنين صدقة ، وتعين الرجل فى دابته فتحمله عليها أو ترفع له عليها متاعة صدقة ، والكلمة الطيبة صدقة ، وبكل خطوة تمشيها إلي الصلاة صدقة ، وتميط الأذي عن الطريق صدقة ).\nرواه البخاري [ رقم : 2989 ] ، ومسلم [ رقم : 1009 ]",
  ),
  HadithModel(
    title: "الحديث السابع والعشرون",
    content: "عن النواس بن سمعان رضي الله عنه ، عن النبي صلى الله عليه وسلم قال : ( البر حسن الخلق والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ). رواه مسلم [ رقم : 2553 ].\nوعن وابصه بن معبد رضي الله عنه ، قال : أتيت رسول الله صلي الله عليه وسلم ، فقال : ( جئت تسأل عن البر ؟ ) قلت : نعم ؛ فقال : ( استفت قلبك ؛ البر ما اطمأنت إليه النفس واطمأن إليه القلب ، والإثم ما حاك في النفس وتردد في الصدر ، وإن أفتاك الناس وأفتوك ).\nحديث حسن ، رويناه في مسندي الإمامين أحمد بن حنبل [4/ 227] ، والدارمي [2/ 246] بإسناد حسن .",
  ),
  HadithModel(
    title: "الحديث الثامن والعشرون",
    content: "عن أبي نجيح العرباض بن سارية رضي الله عنه ، قال : وعظنا رسول الله صلي الله علية وسلم موعظة وجلت منها القلوب ، وذرفت منها الدموع ، فقلنا : يا رسول الله ! كأنها موعظة مودع فأوصنا ، قال : ( أوصيكم بتقوى الله ، والسمع والطاعة وإن تأمر عليكم عبد ، فإنه من يعش منكم فسيرى اختلافا كثيرًا ، عليكم بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ ، واياكم ومحدثات الأمور ، فإن كل بدعة ضلاله ).\nرواه أبو داود [ رقم : 4607 ] والترمذي [ رقم : 2676 ] وقال : حديث حسن صحيح.",
  ),
  HadithModel(
    title: "الحديث التاسع والعشرون",
    content: "عن معاذ بن جبل رضي الله عنه ، قال : قلت : يا رسول الله ! أخبرني بعمل يدخلني الجنه ويباعدني عن النار ، قال : ( لقد سألت عن عظيم ، وإنه ليسير على من يسره الله عليه : تعبد الله لا تشرك به شيئاَ ، وتقيم الصلاة ، وتؤتي الزكاة ، وتصوم رمضان ، وتحج البيت ) ثم قال : ( ألا أدلك على أبواب الخير ؟: الصوم جنة ، والصدقة تطفىء الخطيئة كما يطفىء الماء النار ، وصلاة الرجل في جوف الليل ) ثم تلا : { تتجافى جنوبهم عن المضاجع } حتى بلغ { يعملون } [ 32 سورة السجدة / الأيتان : 16 و 17 ] ثم قال : ( ألا أخبرك برأس الأمر وعموده وذروة سنامه ؟ ) قلت : بلى يا رسول الله ، قال : ( رأس الأمر الإسلام ، وعموده الصلاة ، وذروة سنامه الجهاد ) ثم قال : ( ألا أخبرك بملا ذلك كله ؟ ) فقلت : بلى يا رسول الله ! فأخذ بلسانه وقال : ( كف عليك هذا )، قلت : يا نبي الله وإنما لمؤاخذون بما نتكلم به ؟ فقال : ( ثكلتك أمك وهل يكب الناس في النار على وجوههم –أو قال : (على مناخرهم )- إلا حصائد ألسنتهم ؟!).\nرواه الترمذي [ رقم : 2616 ] وقال : حديث حسن صحيح .",
  ),
  HadithModel(
    title: "الحديث الثلاثون",
    content: "عن أبي ثعلبة الخشني جرثوم بن ناشر رضي الله عنه ، عن رسول الله صلي الله عليه وسلم ، قال : (إن الله تعالى فرض فرائض فلا تضيعوها ، وحد حدودًا فلا تعتدوها ، وحرم أشياء فلا تنتهكوها ، وسكت عن أشياء رحمة لكم غير نسيان فلا تبحثوا عنها ).\nحديث حسن ، رواه الدارقطني [(في سننه) 4/ 184 ] ، وغيره .",
  ),
  HadithModel(
    title: "الحديث الحادي والثلاثون",
    content: "عن أبي العباس سهل بن سعد الساعدي رضي الله عنه ، قال : جاء رجل إلى النبي صلى الله عليه وسلم ، فقال : يا رسول الله ! دلني على عمل إذا عملته أحبني الله وأحبني الناس ؛ فقال : ( ازهد في الدنيا يحبك الله ، وازهد فيما عند الناس يحبك الناس ).\nحديث حسن ، رواه ابن ماجه [ رقم : 4102 ] ، وغيره بأسانيد حسنه .",
  ),
  HadithModel(
    title: "الحديث الثاني والثلاثون",
    content: "عن أبي سعيد سعد بن مالك بن سنان الخدري رضي الله عنه ، أن رسول الله صلى الله عليه وسلم قال : ( لا ضرر ولا ضرار ).\nحديث حسن ، رواه ابن ماجه [راجع رق : 2341 ] والدارقطني [ رقم : 4/ 228] وغيرهما مسندا.",
  ),
  HadithModel(
    title: "الحديث الثالث والثلاثون",
    content: "عن ابن عباس رضي الله عنهما ، أن رسول الله صلى الله عليه وسلم ، قال : ( لو يعطى الناس بدعواهم ، لادعى رجال أموال قوم ودماءهم ، لكن البينة على المدعي واليمين على من أنكر).\nحديث حسن ، رواه البيهقي [ في (السنن)10/ 252 ] وغيره هكذا ، وبعضه في (الصحيحين).",
  ),
  HadithModel(
    title: "الحديث الرابع والثلاثون",
    content: "عن أبي سعيد الخدري رضي الله عنه ، قال : سمعت رسول الله صلي الله عليه وسلم يقول : ( من رأى منكم منكرًا فليغيره بيده ، فإن لم يستطع فبلسانه ، فإن لم يستطع فبقلبه ، وذلك أضعف الإيمان ).\nرواه مسلم [ رقم : 49 ].",
  ),
  HadithModel(
    title: "الحديث الخامس والثلاثون",
    content: "عن أبي هريرة رضي الله عنه ، قال : قال رسول الله صلي الله عليه وسلم : ( لا تحاسدوا ، ولا تناجشوا ، ولا تباغضوا ، ولا تدابروا ، ولا يبع بعضكم على بيع بعض ، وكونوا عباد الله إخوانا ، المسلم اخو المسلم ، لا يظلمه ولا يخذله ، ولا يكذبه ، ولا يحقره ، التقوى ها هنا ) ويشير صلى الله عليه وسلم إلى صدره ثلاث مرات – ( بحسب امرىء أن يحقر أخاه المسلم ، كل المسلم على المسلم حرام : دمه وماله وعرضه ).\nرواه مسلم [ رقم : 2564 ].",
  ),
  HadithModel(
    title: "الحديث السادس والثلاثون",
    content: "عن أبي هريرة رضي الله عنه ، عن النبي صلى الله عليه وسلم ، قال : ( من نفس عن مؤمن كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة ، ومن يسر على معسر يسر الله عليه في الدنيا والاخرة ، ومن ستر مسلما ستره الله في الدنيا والأخرة ، والله في عون العبد ما كان العبد في عون أخيه ، ومن سلك طريقا يلتمس فيه علما سهل الله له به طريقا إلي الجنه ، وما اجتمع قوم في بيت من بيوت الله يتلون كتاب الله ، ويتدارسونه بينهم؛ إلا نزلت عليهم السكينه ، وغشيتهم الرحمه ، وحفتهم الملائكة ، وذكرهم الله فيمن عنده ، ومن أبطأ به عمله لم يسرع به نسبه ).\nرواه مسلم [ رقم : 2699 ] بهذا اللفظ .",
  ),
  HadithModel(
    title: "الحديث السابع والثلاثون",
    content: "عن ابن عباس رضي الله عنهما ، عن رسول الله صلى الله علية وسلم فيما يرويه عن ربه تبارك وتعالى ، قال : ( إن الله تعالى كتب الحسنات والسيئات ، ثم بين ذلك ، فمن هم بحسنة فلم يعملها كتبها الله عنده حسنة كاملة ، وإن هم بها فعملها كتبها الله تعالى عنده عشر حسنات إلى سبعمائة ضعف إلى أضعاف كثيرة ، وإن هم بسيئة فلم يعملها كتبها الله عنده حسنة كاملة ، وإن هم بها فعملها كتبها الله عنده سيئة واحدة ).\nرواه البخاري [ رقم : 6491 ] ومسلم [ رقم : 131 ] في ( صحيحيهما ) بهذه الحروف .",
  ),
  HadithModel(
    title: "الحديث الثامن والثلاثون",
    content: "عن أبي هريرة رضي الله عنه ، قال : قال رسول الله صلي الله عليه وسلم : ( إن الله تعالى قال : من عادى لي وليا فقد آذنته بالحرب ، وما تقرب إلي عبدي بشيء أحب إلي مما افترضته عليه ، ولا يزال عبدي يتقرب إلي بالنوافل حتي أحبه ، فإذا أحببته كنت سمعه الذي يسمع به ، وبصره الذي يبصر فيه ، ويده التي يبطش بها ، ورجله التي يمشي بها ، ولئن سألني لأعطينه ، ولئن استعاذني لأعيذنه ).\nرواه البخاري [ رقم : 6502 ].",
  ),
  HadithModel(
    title: "الحديث التاسع والثلاثون",
    content: "عن ابن عباس رضي الله عنهما ، أن رسول الله صلى الله عليه وسلم قال : ( إن الله تجاوز لي عن أمتي الخطأ والنسيان وما استكرهوا عليه ).\nحديث حسن ، رواه ابن ماجه [ رقم : 2045 ] والبيهقي [ ( السنن ) 7 / 356 ] وغيرهما .",
  ),
  HadithModel(
    title: "الحديث الأربعون",
    content: "عن ابن عمر رضي الله عنهما ، قال : أخذ الرسول صلي الله علية وسلم بمنكبي ، فقال : ( كن في الدنيا كأنك غريب أو عابر سبيل ).\nوكان ابن عمر رضي الله عنهما يقول : إذا أمسيت فلا تنتظر الصباح ، إذا أصبحت فلا تنتظر المساء ، وخذ من صحتك لمرضك ، ومن حياتك لموتك .\nرواه البخاري [ رقم : 6416 ].",
  ),
  HadithModel(
    title: "الحديث الحادي والأربعون",
    content: "عن أبي محمد عبد الله بن عمرو بن العاص رضي الله عنهما ، قال : قال رسول الله صلي الله عليه وسلم : ( لا يؤمن أحدكم حتي يكون هواه تبعا لما جئت به ).\nحديث حسن صحيح . رويناه في كتاب ( الحجة ) بإسناد صحيح .",
  ),
  HadithModel(
    title: "الحديث الثاني والأربعون",
    content: "عن انس رضي الله عنه ، قال : سمعت رسول الله صلي الله عليه وسلم يقول : ( قال الله تعالى : يا ابن ادم ! إنك ما دعوتني ورجوتني غفرت لك على ما كان منك ولا أبالي ، يا ابن آدم ! لو بلغت ذنوبك عنان السماء ، ثم استغفرتني غفرت لك ، يا ابن آدم ! إنك لو اتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئا لأتيتك بقرابها مغفرة ).\nرواه الترمذي [ رقم : 3540 ] وقال : حديث حسن صحيح .",
  ),
  HadithModel(
    title: "الحديث الثالث والأربعون",
    content: "عن ابن عباس رضي الله عنهما ، قال : قال رسول الله صلي الله عليه وسلم : ( ألحقوا الفرائض بأهلها ، فما أبقت الفرائض ، فلأولى رجل ذكر ).\nرواه البخاري [ رقم : 6732 ] ، ومسلم [ رقم : 1615 ].",
  ),
  HadithModel(
    title: "الحديث الرابع والأربعون",
    content: "عن عائشة رضي الله عنها ، عن النبي صلي الله عليه وسلم قال : ( الرضاعة تحرم ما تحرم الولادة ).\nرواه البخاري [ رقم : 2646 ] ، ومسلم [ رقم : 1444 ].",
  ),
  HadithModel(
    title: "الحديث الخامس والأربعون",
    content: "عن جابر بن عبد الله أنه سمع رسول الله صلي الله عليه وسلم عام الفتح وهو بمكة يقول : ( إن الله ورسوله حرم بيع الخمر والميتة والخنزير والأصنام ) فقيل : يا رسول الله أرأيت شحوم الميتة ، فإنه يطلى بها السفن ، ويدهن بها الجلود ، ويستصبح بها الناس ؟ قال : ( لا وهو حرام ) ، ثم قال رسول الله صلى الله عليه وسلم : ( قاتل الله اليهود ، إن الله حرم عليهم الشحوم ، فأجملوه ، ثم باعوه ، فأكلوا ثمنه ).\nرواه البخاري [ رقم : 2236 ] ، ومسلم [ رقم : 1581 ].",
  ),
  HadithModel(
    title: "الحديث السادس والأربعون",
    content: "عن أبي بردة ، عن أبيه أبي موسي الأشعري أن النبي صلى الله عليه وسلم بعثه إلى اليمن ، فسأله عن أشربة تصنع بها ، فقال : ( وما هي ؟ ) قال : البتع والمزر ، فقيل لأبي بردة : وما البتع ؟ قال : نبيذ العسل والمزر نبيذ الشعير ، فقال : ( كل مسكر حرام ).\nرواه البخاري [ رقم : 6214 ].",
  ),
  HadithModel(
    title: "الحديث السابع والأربعون",
    content: "عن المقدام بن معد يكرب قال : سمعت رسول الله صلي الله عليه وسلم يقول :( ما ملأ آدمي وعاء شرا من بطنه ، بحسب ابن آدم أكلات يقمن صلبه ، فإن كان لا محالة ، فثلث لطعامه ، وثلث لشرابه ، وثلث لنفسه ).\nرواه أحمد [ رقم : 4 / 132 ] ، والترمذي [ رقم : 2380 ] ، وابن ماجه [ رقم : 3349 ] ، وقال الترمذي حديث حسن .",
  ),
  HadithModel(
    title: "الحديث الثامن والأربعون",
    content: "عن عبد الله بن عمرو رضي الله عنهما عن النبي صلى الله عليه وسلم قال : ( أربع من كن فيه كان منافقا ، وإن كانت خصلة منهن فيه كانت فيه خصلة من النفاق حتى يدعها : من إذا حدث كذب ، وإذا وعد أخلف ، وإذا خاصم فجر ، وإذا عاهد غدر ).\nرواه البخاري [ رقم : 34 ] ، ومسلم [ رقم : 58 ] .",
  ),
  HadithModel(
    title: "الحديث التاسع والأربعون",
    content: "عن عمر بن الخطاب رضي الله عنه عن النبي صلي الله عليه وسلم قال : ( لو أنكم توكلون علي الله حق توكله لرزقكم كما يرزق الطير ، تغدو خماصا ، وتروح بطانا ).\nرواه أحمد [ رقم : 1/ 30 و 52 ] ، والترمذي [ رقم : 2344 ] ، والنسائي في ( الكبرى ) كما في (التحفة) [ رقم : 8/ 79 ] ، وابن ماجه [ رقم : 4164 ] . وصححه ابن حبان (730 ) ، والحاكم 4 / 318 ، وقال الترمذي : حسن صحيح .",
  ),
  HadithModel(
    title: "الحديث الخمسون",
    content: "عن عبد الله بن بسر قال : أتي النبي صلى الله عليه وسلم رجل ، فقال : يا رسول الله إن شرائع الإسلام قد كثرت علينا ، فباب نتمسك به جامع ؟ قال : ( لا يزال لسانك رطبا من ذكر الله عز وجل ).\nرواه أحمد [ رقم : 188 و 190 ] .",
  ),
];